"""
设置文档,所有的自定义设置都在这了
!!! 一定要确保打开OTC控制器的手机和运行本程序的电脑处在同一个wifi内部 !!!
!!! 一定要记得修改"ws" !!!
!!! "ws" 里的 :60536/1 一定要保留，不然连接不上 !!!

!!!*** 一定要正确设置OTC控制器的通道强度上限 ***!!!
!!!*** 一定要正确设置OTC控制器的通道强度上限 ***!!!
!!!*** 一定要正确设置OTC控制器的通道强度上限 ***!!!
"""

config = {
    "ws": "ws://192.168.8.129:60536/1",             ## 必须修改！必须修改！必须修改！
    "level": "INFO",

    "channel_rand":0.2,                             # 多大概率单通道输出随机变成双通道输出，设为1是100%，0是不触发，0.2是20%概率，以此类推
    "channel_level_factor": {"A": 1, "B": 0.1,},    # 鉴于不同道具输出的强度不同，为不同通道设置了等级系数， ##默认值：A通道：橡胶环 B通道：金属塞子

    "patterns_list":{                               # 波形列表，用不同名称可以选择不同的波形随机范围 "经典", "炼狱2.0", "打屁股", "冲击"是OTC控制器自带波形，剩下的是DIY波形，请在DIY_patterns.py修改
                    "all":["经典", "炼狱2.0", "打屁股", "冲击", "flirting_1", "flirting_2", "榨汁", "压缩"],
                    "early":["炼狱2.0", "打屁股", "flirting_1", "flirting_2"],
                    "medium":["经典", "冲击", "压缩", "炼狱2.0", "flirting_1"],
                    "late":["榨汁", "经典","冲击"],
                    "last":["榨汁"],
    },
    "intensity_range":{                             # 强度范围列表，用不同名称可以选择不同的强度随机范围
                    "low":[15,30], 
                    "medium":[30,55], 
                    "high":[50,80], 
                    "extrem":[70,100],
                    "last":[90,100],
    },
    "rdm_tick_range":{                              # 时间范围列表，用不同名称可以选择不同的时间随机范围， 单位tick， 一秒=10tick
                    "short":[50,150], 
                    "medium":[100,300], 
                    "long":[300,500], 
                    "extrem":[600,1000],
                    "last":[900,2000],
    },
}